Repository: tomekkie/printFileManager
Catalog: languages/*/LC_MESSAGES/pfm.po
Languages: pl_pl

source: Printing file list
pl_pl: Wykaz plików do druku

source: Main directory
pl_pl: Katalog główny

source: print size
pl_pl: wymiary

source: count
pl_pl: ilość

source: printouts in the table
pl_pl: wydruki w tabeli

source: remains to print
pl_pl: pozostaje do druku

source: possible folder attributes:
pl_pl: możliwe atrybuty folderów:

source: archive, skipped in calculations
pl_pl: archiwalny, pomijany w sumowaniu

source: back
pl_pl: powrót

source: Instructions of use
pl_pl: Instrukcja użytkowania

source: This php app serves to sum the areas of printing files.
pl_pl: Ta aplikacja php służy do sumowania powierzchni z plików do druku.

source: The printing files are supposed to be placed in folders and subfolders contained within printing files folder which should be the &quot;<em>public_html</em>&quot; subfolder.
pl_pl: Pliki do druku powinny być umieszczone w folderach lub podfolderach zawartych w folderze plików do druku będącym podfolderem &quot;<em>public_html</em>&quot; na serwerze.

source: The printing areas are calculated automatically on entering the application page. The calculations are based on dimensions encoded in file names like &quot;<em>p5_120x95cm.jpg</em>&quot; or &quot;<em>P01_1536x2420mm.tif</em>&quot;. If the file name doesn't contain dimensions encoded like that, the default 100x100cm printing size will be assumed. If the server php contains Imagemagick extension, then from files with .tif or .jpg extension the printing size will be decoded by Imagemagick. The current application data is stored in json files automatically created inside the application folder.
pl_pl: Powierzchnie druku są wyliczane automatycznie po wejściu na stronę aplikacji. Obliczenia oparte są na wymiarach zakodowanych w nazwach plików jak &quot;<em>p5_120x95cm.jpg</em>&quot; lub &quot;<em>P01_1536x2420mm.tif</em>&quot;. Jeśli nazwa pliku nie zawiera zakodowanych wymiarów, wtedy przyjęta zostanie wartość domyślna wynosząca 100x100cm. Jeżeli na serwerze zainstalowany jest dodatek Imagemagick - to dla plików z rozszerzeniami .tif lub .jpg wymiary zostaną odczytane z plików przez Imagemagick. Bieżące dane aplikacji zapisywane są w plikach json automatycznie tworzonych wewnątrz folderu aplikacji.

source: The count of printouts should be encoded by appending to file name together with &quot;pcs&quot;, like &quot;<em>P21_297x210mm_67pcs.jpg</em>&quot;.
pl_pl: Liczba wydruków powinna być zakodowana poprzez dołączenie na końcu nazwy pliku wraz z &quot;pcs&quot;, na przykład &quot;<em>P21_297x210mm_67pcs.jpg</em>&quot;.

source: When logged as a common user you can browse through the printing folders and mark files as printed. The parent foders get automatically marked as printed when all the contained files are marked as printed. When logged as admin you can also change folder attributes. Folders marked as archive are skipped in area calculations.<br /> <br />
pl_pl: Będąc zalogowany jako użytkownik można przeglądać foldery plików do druku i zaznaczać pliki jako wydrukowane. Folder nadrzędny zostaje automatycznie oznaczony jako wydrukowany, kiedy wszystkie zawarte pliki są wydrukowane. Będąc zalogowany w roli admina można także zmieniać atrybuty folderów. Foldery zaznaczone jako archiwalne są w obliczeniach powierzchni pomijane. <br /> <br />

source: Instalation instructions
pl_pl: Instrukcja instalacji

source: Create a ftp account with main folder being a &quot;<em>public_html</em>&quot; subfolder. This will be your main printing files folder. You can put all your printing files as a loose collection or structured in subfolders there.
pl_pl: Utwórz konto ftp z katalogiem głównym w katalogu &quot;<em>public_html</em>&quot; . Będzie to główny folder plików do druku. Możesz umieszczać w nim pliki do druku luzem, jak też i pogrupowane w podkatalogach.

source: Edit the configuration file &quot;<em>config.php</em>&quot; by entering the printing files folder name and the database settings
pl_pl: Wyedytuj plik konfiguracyjny &quot;<em>config.php</em>&quot; wpisując nazwę foldera plików do druku oraz parametry bazy danych.

source: Create an application folder in &quot;<em>public_html</em>&quot; folder. Copy the content of &quot;<em>printFileManager</em>&quot; there.
pl_pl: Utwórz folder aplikacji w &quot;<em>public_html</em>&quot; . Zawartość folderu &quot;<em>printFileManager</em>&quot; przekopiuj tam.

source: main printing files folder
pl_pl: główny folder plików do druku

source: mysql database parameters:
pl_pl: parametry bazy danych mysql

source: Host name
pl_pl: Nazwa hosta

source: Database name
pl_pl: Nazwa bazy danych

source: Table name
pl_pl: Nazwa tabeli

source: There are two demo users defined
pl_pl: W demo zostało zdefiniowanych dwóch użytkowników

source: user role as common user
pl_pl: rola jako zwykły użytkownik

source: user role as admin, enabled to edit folder statuses
pl_pl: rola jako administrator, uprawniony do ustawiania statusu folderów
